Revit 2027 API
RepeatingReferenceSource.DimensionCount Property
 The dimension count of the repeating reference array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DimensionCount { get; }
Public ReadOnly Property DimensionCount As Integer
	Get
public:
property int DimensionCount {
	int get ();
}
member DimensionCount : int with get
Property Value
Int32
See Also
Reference
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace